# Pivot Table
  - Index= → What goes down the rows
  - Columns= → What goes across the top
  - Values= → What fills the table
  - Aggfunc= → How to summarize if there are duplicates

In [1]:
import pandas as pd
import numpy as np
from pydataset import data
mtcars = data('mtcars')
mtcars.shape

(32, 11)

In [2]:
mtcars.pivot_table(values = 'mpg', index='gear')

            mpg
gear
3     16.106667
4     24.533333
5     21.380000

In [4]:
mtcars.pivot_table(values = 'mpg', index='am')

          mpg
am
0   17.147368
1   24.392308

In [14]:
mtcars.pivot_table(values="mpg", index="cyl", columns="gear", aggfunc="mean")

gear      3       4     5
cyl
4     21.50  26.925  28.2
6     19.75  19.750  19.7
8     15.05     NaN  15.4

# Melt

In [24]:
aq=data('airquality')
aq.shape

(153, 6)

In [25]:
aq.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
1   41.0    190.0   7.4    67      5    1
2   36.0    118.0   8.0    72      5    2
3   12.0    149.0  12.6    74      5    3
4   18.0    313.0  11.5    62      5    4
5    NaN      NaN  14.3    56      5    5

In [26]:
print(aq.isnull().sum())

Ozone      37
Solar.R     7
Wind        0
Temp        0
Month       0
Day         0
dtype: int64

In [27]:
aq.info()

<class 'pandas.core.frame.DataFrame'>
Index: 153 entries, 1 to 153
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ozone    116 non-null    float64
 1   Solar.R  146 non-null    float64
 2   Wind     153 non-null    float64
 3   Temp     153 non-null    int64
 4   Month    153 non-null    int64
 5   Day      153 non-null    int64
dtypes: float64(3), int64(3)
memory usage: 8.4 KB

In [42]:
aq_long = aq.melt( id_vars=['Month','Day'], value_vars=['Ozone', 'Solar.R', 'Wind', 'Temp'], var_name='Measurement', value_name='Value')

aq_long.head()

   Month  Day Measurement  Value
0      5    1       Ozone   41.0
1      5    2       Ozone   36.0
2      5    3       Ozone   12.0
3      5    4       Ozone   18.0
4      5    5       Ozone    NaN